{
    "age": 22,
    "archived_comments": null,
    "armory_link": "https://worldofwarcraft.blizzard.com/en-us/character/us/illidan/Sarulock ",
    "battlenet_contact": "Saru#11228",
    "character_name": "Sarulock-Illidan",
    "discord_contact": "Saru#8152",
    "id": 226,
    "pizza_question": "Pineapple does not even belong in the same sentence as pizza :D",
    "primary_spec": "The best one (have played all in M progression)",
    "proclivity_summary": "I play WoW nearly every day. That said, sometimes IRL gets in the way and it prevents me from playing (which I am happy with). I definitely play a lot at start of seasons and play less once progression is over.",
    "raiderio_link": "https://raider.io/characters/us/illidan/Sarulock",
    "real_life_summary": "I am a 22 year old student studying engineering in Canada. I like to be physically active (sports, working out), be outdoors with friends, and travel. I am someone who has an objective perspective on a lot of topics, often results in me being disciplined (sometimes too much) to achieve my goals. I am a confident person, who believes they can do anything if I truly work for it and not in a cheesy optimistic way :)",
    "skills_summary": "I have multiple CEs in past tiers (Nya, CN, SOD, 6/8M VOTI) and non CE tiers (SotFO, VOTI) resulted because I stopped playing the game due to IRL commitments. My strongest tier (SOD), the guild ranked world 500. I have a progression-first mindset so I do not take criticism personally as I understand I can improve to help the guild. That said, I am a quick learner and watch fights ahead of time (via Youtube and RWF) to ensure I know fights ahead of time and do not slow down the raid. When I make mistakes, I often know why I made them and how to fix them. Additionally, I will offer my opinion to the raid and others as required, making sure I am not being condescending towards them but have a focus of improving the roster.",
    "team_choice": "Windbridge",
    "warcraftlogs_link": "https://www.warcraftlogs.com/character/us/illidan/sarulock# (pug life is rough)",
    "wow_class": "Warlock"
}